/*---------------------------------------------------------------------------------------------------
                            V8, করে না লেইট 
--------------------------------------------------------------------------------------------------*/
// ১। জাভাস্ক্রিপ্টের কোড কিভাবে চলে ?
// জাভাস্ক্রিপ্ট যখন কোড পায় তখন তিনটা ধাপে কাজ করে।
// ক) পারসিংঃ- জাভাস্ক্রিপ্ট কোডকে বিভিন্ন ছোট ছোট টোকেনে ভাগ করে। সেগুল দিয়ে Abstract Syntax Tree তৈরি করে
// খ) কম্পাইলেশনঃ- তারপর সোর্স কোডকে মেশিন কোডে রূপান্তর করে
// গ) এক্সিকিউশনঃ- এরপর কম্পাইল করা কোডকে এক্সিকিউট করে রেজাল্ট রিটার্ন করে। এক্ষেত্রে বারবার ইউ

// ২। V8 ইঞ্জিনের কাজ কি ?
// JavaScript কোডকে দ্রুত বুঝে ও চালায় (execute করে)।

// ৩। Jit Compiler কিভাবে কাজ করে?
// JIT Compiler বা Just-In-Time Compiler এমন একটি প্রযুক্তি যা JavaScript ইঞ্জিন (যেমন V8) ব্যবহার করে JavaScript কোডকে চালানোর সময় সরাসরি মেশিন কোডে রূপান্তর করে। এটি প্রথমে JavaScript কোডকে পার্স করে একটি ইন্টারমিডিয়েট ফর্মে নিয়ে যায়, তারপর যখন বারবার একই কোড চালানো হয়, তখন সেটিকে দ্রুত চলার জন্য অপটিমাইজ করে মেশিন কোডে রূপান্তর করে। এর ফলে কোড অনেক দ্রুত চলে, কারণ ব্রাউজার আর আলাদা করে প্রতিবার ইন্টারপ্রেট করে না, বরং অপটিমাইজ করা মেশিন কোড ব্যবহার করে। JIT Compiler মূলত রানটাইমে কাজ করে, মানে প্রোগ্রাম চালু হওয়ার সময়ই কম্পাইল করে।
